
const CONSTANT = {
    websocketPorts: {
        realmonitor: "realmonitor-websocket",
        playback: "playback-websocket",
        realmonitor_ws: "9100",
        playback_ws: "9320",
        realmonitor_wss: "9102",
        playback_wss: "9322"
    },
    // 播放器错误信息
    errorVideoInfo: {
        101: "播放延时大于8s",
        201: "当前音频无法播放",
        202: "websocket连接错误",
        203: "文件播放完成",
        // 204: "连接失败，请检查设备",
        401: "该用户无操作权限",
        404: "请求超时或未找到",
        405: "播放超时",
        406: "视频流类型解析失败，请检查通道配置",
        407: "请求超时",
        409: "请求超时或码流不支持",
        411: "录像播放完成",
        457: "时间设置错误",
        503: "WS连接地址错误，非当前连接的ICC服务器返回",
        504: "对讲失败",
        701: "Chrome版本低，请升级到最新的Chrome版本",
        702: "Firefox版本低，请升级到最新的Firefox版本",
        703: "Edge版本低，请升级到最新的Edge版本",
        defaultErrorMsg: "播放失败，请检查配置"
    },
    // 错误信息
    errorInfo: {
        // 实时预览 1xx
        101: "所选通道离线，无法播放",
        102: "登录权限过期，查询实时预览rtsp失败",
        103: "接口未通，请检查项目后端是否未转发接口。",
        // 录像回放 2xx
        201: "所选通道未查询到录像文件",
        202: "查询录像文件列表失败",
        203: "查询录像rtsp失败",
        204: "$0倍速无法播放音频",
        // 对讲 3xx
        301: "正在对讲，无法打开音频",
        302: "其他设备对讲中，无法开启音频",
        303: "其他设备对讲中，无法开启对讲",
        304: "查询对讲rtsp失败",
        305: "http协议不支持对讲",
        // wsplayer/解码库相关 5xx
        501: "解码库未初始化完成，请稍后播放！",
        502: "解码库未初始化完成，请稍后对讲！",
        503: "请检查创建播放器时，播放器容器是否存在",
        // wsplayer对外方法相关 6xx
        601: "所操作播放器不存在",
        602: "所选播放器正在本地录像中，不可重复本地录像",
        603: "所选播放器未播放录像，不可本地录像",
        604: "所选播放器未开始本地录像，不可操作关闭本地录像",
        605: "时间跳转播放传参错误",
        606: "设置自适应拉伸传参错误",
        607: "实时预览不支持倍速播放",
        608: "需传入正确的$0方法：$1",
        // 云台
        701: "云台被用户$0锁定，无法操作",
        702: "控制云台三维定位失败$0",
        703: "控制云台$0$1失败$2",
        704: "控制云台方向失败$0"
    }
}

export default CONSTANT
